Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy

Terraform will perform the following actions:

  # aws_lb_listener.lb_listener will be updated in-place
~ resource "aws_lb_listener" "lb_listener" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:096370227225:listener/app/atlantis-lb-tf/2bf03333af158c1c/1c2d3f9400f0ba0a"
        tags              = {}
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:096370227225:targetgroup/tf-main-lb-tg/4abfbcc6d5f1d563" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_listener_rule.listener_rule will be updated in-place
~ resource "aws_lb_listener_rule" "listener_rule" {
        id           = "arn:aws:elasticloadbalancing:us-east-1:096370227225:listener-rule/app/atlantis-lb-tf/2bf03333af158c1c/1c2d3f9400f0ba0a/b7977c7e1f501977"
        tags         = {}
        # (4 unchanged attributes hidden)

      ~ action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:096370227225:targetgroup/tf-main-lb-tg/4abfbcc6d5f1d563" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group.atlantis will be created
+ resource "aws_lb_target_group" "atlantis" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "tf-atlantis-lb-tg"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-06ed4f95b2d90bfde"

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_lb_target_group.main will be destroyed
- resource "aws_lb_target_group" "main" {
      - arn                                = "arn:aws:elasticloadbalancing:us-east-1:096370227225:targetgroup/tf-main-lb-tg/4abfbcc6d5f1d563" -> null
      - arn_suffix                         = "targetgroup/tf-main-lb-tg/4abfbcc6d5f1d563" -> null
      - deregistration_delay               = 300 -> null
      - id                                 = "arn:aws:elasticloadbalancing:us-east-1:096370227225:targetgroup/tf-main-lb-tg/4abfbcc6d5f1d563" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - name                               = "tf-main-lb-tg" -> null
      - port                               = 4141 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - target_type                        = "instance" -> null
      - vpc_id                             = "vpc-06ed4f95b2d90bfde" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 5 -> null
          - interval            = 30 -> null
          - matcher             = "200" -> null
          - path                = "/" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }
    }

  # aws_lb_target_group_attachment.main will be created
+ resource "aws_lb_target_group_attachment" "main" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = (known after apply)
      + target_id        = "i-081fb3e311c2ba080"
    }

Plan: 2 to add, 2 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.jmvbxx.com/lock?id=jmvbxx%252Fatlantis-ansible%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>
Plan: 2 to add, 2 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
